Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.csi-smb-helm.helm_release.deployment will be updated in-place
~ resource "helm_release" "deployment" {
      ~ id                         = "csi-smb-driver" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.18.0" -> (known after apply)
          ~ chart          = "csi-driver-smb" -> (known after apply)
          ~ first_deployed = 1774735695 -> (known after apply)
          ~ last_deployed  = 1774735695 -> (known after apply)
          ~ name           = "csi-smb-driver" -> (known after apply)
          ~ namespace      = "kube-system" -> (known after apply)
          ~ notes          = <<-EOT
                The CSI SMB Driver is getting deployed to your cluster.
                
                To check CSI SMB Driver pods status, please run:
                
                  kubectl --namespace=kube-system get pods --selector="app.kubernetes.io/name=csi-smb-driver" --watch
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - controller = {
                      - replicas = 2
                    }
                }
            ) -> (known after apply)
          ~ version        = "1.18.0" -> (known after apply)
        } -> (known after apply)
        name                       = "csi-smb-driver"
      ~ version                    = "1.18.0" -> "1.20.1"
        # (29 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.hozzlab.ca/lock?id=rbmfullerton-ca%252Fhomelab%252F.%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```